-- =====================================================================================================================
-- 建库 - 主库
-- =====================================================================================================================

DROP DATABASE IF EXISTS `one_platform`;

CREATE DATABASE IF NOT EXISTS `one_platform`
    DEFAULT CHARACTER SET `utf8mb4`
    DEFAULT COLLATE `utf8mb4_0900_ai_ci`;

-- =====================================================================================================================
-- 建库 - 定时任务库 - Quartz
-- =====================================================================================================================

DROP DATABASE IF EXISTS `one_quartz`;

CREATE DATABASE IF NOT EXISTS `one_quartz`
    DEFAULT CHARACTER SET `utf8mb4`
    DEFAULT COLLATE `utf8mb4_0900_ai_ci`;

-- =====================================================================================================================
-- 建库 - 示例测试库
-- =====================================================================================================================

DROP DATABASE IF EXISTS `webapp`;

CREATE DATABASE IF NOT EXISTS `webapp`
    DEFAULT CHARACTER SET `utf8mb4`
    DEFAULT COLLATE `utf8mb4_0900_ai_ci`;
